capita-API_tests/src/test/java/data/GetByDocumentId.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:doc="https://www.capita.co.uk/TfL/docstore">
   <soapenv:Header/>
   <soapenv:Body>
      <doc:GetByDocumentId>
         <!--Optional:-->
         <doc:documentId>#(docid)</doc:documentId>
      </doc:GetByDocumentId>
   </soapenv:Body>
</soapenv:Envelope>